resume/hrmresume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-25 Thu 10:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hassan McGinnis | Résumé</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hassan" />
<link rel="stylesheet" type="text/css" href="../css/site.css">
</head>
<body>
<div id="content">
<h1 class="title">Hassan McGinnis | Résumé</h1>

<div id="outline-container-orge7eb32b" class="outline-2 row title">
<h2 id="hassan-mcginnis">Hassan McGinnis</h2>
<div class="outline-text-2" id="text-hassan-mcginnis">
<p>
<p style="font-size:14px;line-height:25px">
<b>Software Developer</b>  |  <b>Controls Engineer</b> <br />
Natick, MA  |  (502) 295-8499 <br />
<code>hassan.mcginnis@gmail.com</code> | <a href="https://www.linkedin.com/in/hrmcginnis">linkedin.com/in/hrmcginnis</a> | <a href="https://hrmcginnis.github.io">hrmcginnis.github.io</a> <br />
</p>
</p>
</div>
</div>

<div id="outline-container-org5edf04a" class="outline-2">
<h2 id="org5edf04a"></h2>
<div class="outline-text-2" id="text-org5edf04a">
<hr />
</div>

<div id="outline-container-orgc2bd8c2" class="outline-3 row">
<h3 id="summary">Summary</h3>
<div class="outline-text-3" id="text-summary">
<p>
I'm an engineer with professional software development and test experience using MATLAB, Simulink, Python and C++. I also have research experience in robust control of aircraft control surfaces and signal processing for structural vibration analysis.
</p>
</div>
</div>

<div id="outline-container-org0baed79" class="outline-3 row">
<h3 id="software-skills">Software Skills</h3>
<div class="outline-text-3" id="text-software-skills">
<p>
<b>Tools</b>: MATLAB, Simulink, Stateflow, GNU/Linux, Emacs, Git, Bamboo
</p>

<p>
<b>Languages</b>: MATLAB, Python, C++, Bash
</p>
</div>
</div>

<div id="outline-container-orge3697cb" class="outline-3 row notext">
<h3 id="projects">Projects</h3>
<div class="outline-text-3" id="text-projects">
</div>
<div id="outline-container-org873231a" class="outline-4 col notext">
<h4 id="org873231a"></h4>
<div class="outline-text-4" id="text-org873231a">
</div>
<div id="outline-container-org5358e93" class="outline-5">
<h5 id="medacuity-software-verification">MedAcuity Software | Controls Software Verification for Robotic Assisted Surgery System</h5>
<div class="outline-text-5" id="text-medacuity-software-verification">
<p>
<i>Aug 2017 - present</i>
</p>

<ul class="org-ul">
<li>Created, implemented, and documented a strategy for verification and MC/DC test coverage of state machines and control algorithms for robotic arm motion implemented in Simulink.</li>
<li>Led a team of remote test engineers through verification of functional and non-functional software requirements implemented in Simulink and C++.</li>
<li>Developed and validated a Python framework and Bamboo test plan for batch execution of C++ requirements tests and Simulink unit tests.</li>
</ul>
</div>
</div>

<div id="outline-container-org33dde6c" class="outline-5">
<h5 id="mathworks-python-system-object">MathWorks | Development of Python System Object for Simulink Raspberry Pi Support Package</h5>
<div class="outline-text-5" id="text-mathworks-python-system-object">
<p>
<i>May 2016</i>
</p>

<ul class="org-ul">
<li>Developed a Simulink block in MATLAB and C for the Raspberry Pi support package that interfaces with the Python/C API, allowing users to easily send simulation data to any Python module on the Raspberry Pi in soft real-time.</li>
<li>Created a demo using the Python System object block in Simulink to drive a servomotor with a Raspberry Pi using the RaspiRobot Python library.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc741e66" class="outline-5">
<h5 id="purdue-h-infinity-control">Purdue University | Sensitivity analysis of wear prognosis in an \(H_\infty\) controlled F-16 simulation</h5>
<div class="outline-text-5" id="text-purdue-h-infinity-control">
<p>
<i>Aug 2010 - Dec 2011</i>
</p>

<ul class="org-ul">
<li>Investigated the minimization of fault propagation in a hydraulic actuator through real-time adjustment in the commanded flight path.</li>
<li>Developed a robust altitude controller for an F-16 fighter aircraft model using \(H_\infty\) synthesis.</li>
<li>Performed sensitivity analysis of the path adjustment algorithm under modeling error.</li>
<li>Demonstrated the improved control strategy using a hydraulic solenoid valve hardware-in-the-loop system prototyped in Simulink and driven by dSPACE software.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge4865ed" class="outline-3 row notext">
<h3 id="work-experience">Work Experience</h3>
<div class="outline-text-3" id="text-work-experience">
</div>
<div id="outline-container-org762fe50" class="outline-4 col notext">
<h4 id="org762fe50"></h4>
<div class="outline-text-4" id="text-org762fe50">
</div>
<div id="outline-container-org6459a7d" class="outline-5">
<h5 id="medacuity-software-software-specialist">MedAcuity Software | Software Specialist | Westford, MA</h5>
<div class="outline-text-5" id="text-medacuity-software-software-specialist">
<p>
<i>July 2017 - present</i>
</p>

<ul class="org-ul">
<li>Software consultant for clients in the medical device industry.</li>
<li>Specialist in MATLAB, Simulink, and Python test and development.</li>
</ul>
</div>
</div>

<div id="outline-container-org06756c8" class="outline-5">
<h5 id="mathworks-senior-application-engineer-post-sales">MathWorks | Senior Application Engineer (Post-sales) | Natick, MA</h5>
<div class="outline-text-5" id="text-mathworks-senior-application-engineer-post-sales">
<p>
<i>Sept 2013 - July 2016</i>
</p>

<ul class="org-ul">
<li>Specialist in Simulink code generation workflows, providing solutions for customers using Simulink Coder and Embedded Coder for production C/C++ code generation.</li>
<li>Developed/supported software improvements for MATLAB and Simulink motivated by direct customer needs, including the ability to generate MISRA compliant code, enhanced user customization of generated code, and improved support for third-party compilers.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org8d9b3ec" class="outline-3 row notext">
<h3 id="education">Education</h3>
<div class="outline-text-3" id="text-education">
</div>

<div id="outline-container-orgcdf2d5e" class="outline-4">
<h4 id="purdue-university">Purdue University</h4>
<div class="outline-text-4" id="text-purdue-university">
<p>
MS Mechanical Engineering | 3.81/4.00 | Dec 2011
</p>
</div>
</div>

<div id="outline-container-org6b6f548" class="outline-4">
<h4 id="university-of-kentucky">University of Kentucky</h4>
<div class="outline-text-4" id="text-university-of-kentucky">
<p>
​BS Mechanical Engineering | 3.46/4.00 | May 2009
</p>
</div>
</div>
</div>

<div id="outline-container-orgbdba57e" class="outline-3 row">
<h3 id="resume-in-org-mode">Résumé</h3>
<div class="outline-text-3" id="text-resume-in-org-mode">
<p>
Generated with <a href="https://orgmode.org/">Emacs Org mode</a> 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
